
{
  "moviesList" : [
    { "id": 1, "title": "Captain América","director":"Joe Johnston", "imdb":"6,9",  "detail":"Captain America: The First Avenger is a 2011 American superhero film based on the Marvel Comics character Captain America. Produced by Marvel Studios and distributed by Paramount Pictures,[N 1] it is the fifth film in the Marvel Cinematic Universe (MCU). The film was directed by Joe Johnston, written by Christopher Markus and Stephen McFeely, and stars Chris Evans as Steve Rogers / Captain America alongside Tommy Lee Jones, Hugo Weaving, Hayley Atwell, Sebastian Stan, Dominic Cooper, Neal McDonough, Derek Luke, and Stanley Tucci. During World War II, Steve Rogers, a frail man, is transformed into the super-soldier Captain America and must stop the Red Skull from using the Tesseract as an energy source for world domination.", "image": "https://cdn5.jokeblogger.com/sites/default/files/imagecache/topic_large/category_pictures/Captain-America1386708947.jpg", "trailer":"https://www.youtube.com/embed/JerVrbLldXw" },

    { "id": 2, "title": "Iron Man", "director":"Jon Favreau", "imdb":"7,9",  "detail":"Iron Man is a 2008 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Paramount Pictures,[N 1] it is the first film in the Marvel Cinematic Universe (MCU). It was directed by Jon Favreau from a screenplay by the writing teams of Mark Fergus and Hawk Ostby, and Art Marcum and Matt Holloway, and stars Robert Downey Jr. as Tony Stark / Iron Man alongside Terrence Howard, Jeff Bridges, Shaun Toub, and Gwyneth Paltrow. In the film, following his escape from captivity by a terrorist group, world famous industrialist and master engineer Tony Stark builds a mechanized suit of armor and becomes the superhero Iron Man.", "image": "https://elladog.com.ar/wp-content/uploads/2018/01/iron-man-_-360x240.jpg", "trailer":"https://www.youtube.com/embed/KAE5ymVLmZg" },


    { "id": 3, "title": "Black Panter", "director":"Ryan Coogler", "imdb":"7,3", 
    "detail" : "Black Panther is a 2018 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 18th film in the Marvel Cinematic Universe (MCU). The film was directed by Ryan Coogler, who co-wrote the screenplay with Joe Robert Cole, and it stars Chadwick Boseman as T'Challa / Black Panther alongside Michael B. Jordan, Lupita Nyong'o, Danai Gurira, Martin Freeman, Daniel Kaluuya, Letitia Wright, Winston Duke, Angela Bassett, Forest Whitaker, and Andy Serkis. In Black Panther, T'Challa is crowned king of Wakanda following his father's death, but he is challenged by Killmonger who plans to abandon the country's isolationist policies and begin a global revolution.", "image": "https://www.log.com.tr/wp-content/uploads/2018/03/Black-Panther-movie-powered-costume.jpg", "trailer":"https://www.youtube.com/embed/dxWvtMOGAhw" },


    { "id": 4, "title": "Avengers", "director":"Anthony Russo, Joss Whedon, Joe Russo" , "imdb":"8,0", "detail":"Marvel's The Avengers[6] (classified under the name Marvel Avengers Assemble in the United Kingdom and Ireland[3][7]), or simply The Avengers, is a 2012 American superhero film based on the Marvel Comics superhero team of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures,[N 1] it is the sixth film in the Marvel Cinematic Universe (MCU). Written and directed by Joss Whedon, the film features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, and Jeremy Renner as the Avengers, alongside Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård, and Samuel L. Jackson. In the film, Nick Fury and the spy agency S.H.I.E.L.D. recruit Tony Stark, Steve Rogers, Bruce Banner, and Thor to form a team capable of stopping Thor's brother Loki from subjugating Earth.", "image": "https://i4.hurimg.com/i/hurriyet/75/750x422/5ae36f11d3806c1da0f68f1d.jpg", "trailer":"https://www.youtube.com/embed/6ZfuNTqbHE8" },


    { "id": 5, "title": "Deadpool", "director":"Tim Miller", "imdb":"8,0",  "detail":"Deadpool is a 2016 American superhero film based on the Marvel Comics character of the same name. Distributed by 20th Century Fox, it is the eighth film in the X-Men film series. Directed by Tim Miller from a screenplay by Rhett Reese and Paul Wernick, it stars Ryan Reynolds in the title role alongside Morena Baccarin, Ed Skrein, T. J. Miller, Gina Carano, and Brianna Hildebrand. In the film, Wade Wilson hunts the man who gave him mutant abilities and a scarred physical appearance, becoming the beloved antihero Deadpool. Development of a Deadpool film starring Reynolds began in February 2004, before he went on to play the character in X-Men Origins: Wolverine in 2009. Reese and Wernick were hired for a spinoff in 2010. They worked with Reynolds to adapt the character more faithfully (including his fourth wall breaking) after the portrayal in Wolverine was criticized for not doing so. Miller was hired in 2011, marking his directorial debut. An enthusiastic response to leaked test footage he created with Reynolds led to a green-light from Fox in 2014. Additional casting began in early 2015, and filming took place in Vancouver, Canada, from March to May of that year. Several vendors provided visual effects for the film, ranging from the addition of blood and gore to the creation of the CG character Colossus.","image": "https://pazarlamasyon.com/wp-content/uploads/2018/05/Deadpool.jpg", "trailer":"https://www.youtube.com/embed/ONHBaC-pfsk" },


    { "id": 6, "title": "Hulk", "director":"Ang Lee", "imdb":"6,7",  "detail":"Hulk (also known as The Hulk) is a 2003 American superhero film based on the Marvel Comics character of the same name, directed by Ang Lee and written by James Schamus, Michael France, and John Turman, from a story by Schamus. Eric Bana stars as Bruce Banner/Hulk, alongside Jennifer Connelly, Sam Elliott, Josh Lucas, and Nick Nolte. The film explores the origins of Bruce Banner. After a lab accident involving gamma radiation, he finds himself able to turn into a giant green-skinned creature whenever emotionally provoked or stressed. The United States military pursues him, and he comes into conflict with his biological father, who has a dark plan for his son.", "image": "https://www.merlininkazani.com/images/games/12419/105765_640.jpg", "trailer":"https://www.youtube.com/embed/xbqNb2PFKKA" },


    { "id": 7, "title": "Thor", "director":"Kenneth Branagh", "imdb":"7,0", "detail":"Thor is a 2011 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Paramount Pictures,[N 1] it is the fourth film in the Marvel Cinematic Universe (MCU). It was directed by Kenneth Branagh, written by the writing team of Ashley Edward Miller and Zack Stentz along with Don Payne, and stars Chris Hemsworth as the title character alongside Natalie Portman, Tom Hiddleston, Stellan Skarsgård, Colm Feore, Ray Stevenson, Idris Elba, Kat Dennings, Rene Russo, and Anthony Hopkins. After reigniting a dormant war, Thor is banished from Asgard to Earth, stripped of his powers and his hammer Mjölnir. As his brother Loki plots to take the Asgardian throne, Thor must prove himself worthy.", "image": "https://www.log.com.tr/wp-content/uploads/2019/06/thor-1-1280x720.jpg", "trailer":"https://www.youtube.com/embed/JOddp-nlNvQ" },


    { "id": 8, "title": "Spiderman", "director":"Sam Raimi", "imdb":"7,3",  "detail":"Spider-Man 2 is a 2004 American superhero film directed by Sam Raimi and written by Alvin Sargent from a story by Alfred Gough, Miles Millar and Michael Chabon. Based on the fictional Marvel Comics character of the same name, it is the second installment in the Spider-Man trilogy and the sequel to Spider-Man (2002), starring Tobey Maguire alongside Kirsten Dunst, James Franco, Alfred Molina, Rosemary Harris, and Donna Murphy. Set two years after the events of Spider-Man, the film finds Peter Parker struggling to manage both his personal life and his duties as Spider-Man, which affects his civilian life dramatically. Meanwhile, Dr. Otto Octavius becomes a diabolical villain after a failed experiment kills his wife and leaves him neurologically fused to mechanical tentacles. Spider-Man must stop him from successfully recreating the dangerous experiment, while dealing with a subconscious desire to stop being Spider-Man that is stripping him of his powers. Raimi's inspiration for the film came from the comic book debut of Doctor Octopus in 1964, the 1966 story arc If This Be My Destiny...!, and the 1967 story arc Spider-Man No More! Principal photography began in April 2003 in New York City and also took place in Los Angeles. Reshoots took place later that year and concluded in December.", "image": "https://shiftdelete.net/wp-content/uploads/2020/02/yeni-spiderman-filmi-cikis-tarihi-belli-oldu.jpg", "trailer":"https://www.youtube.com/embed/TYMMOjBUPMM" }
  ]
}